MCUdude/MightyCore/avr/boards.txt
# Clock frequencies
#make atmega324a AVR_FREQ=16000000L BAUD_RATE=115200 UART=0 LED=B0 LED_START_FLASHES=2
#make atmega324p AVR_FREQ=16000000L BAUD_RATE=115200 UART=0 LED=B0 LED_START_FLASHES=2
#make atmega324pa AVR_FREQ=16000000L BAUD_RATE=115200 UART=0 LED=B0 LED_START_FLASHES=2
324.menu.clock.16MHz_external=16 MHz external
324.menu.clock.16MHz_external.upload.speed=115200
324.menu.clock.16MHz_external.bootloader.low_fuses=0xf7
324.menu.clock.16MHz_external.bootloader.high_fuses=0xd6
324.menu.clock.16MHz_external.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.speed}_{build.f_cpu}.hex
324.menu.clock.16MHz_external.build.f_cpu=16000000L

#make atmega324a AVR_FREQ=20000000L BAUD_RATE=115200 UART=0 LED=B0 LED_START_FLASHES=2
#make atmega324p AVR_FREQ=20000000L BAUD_RATE=115200 UART=0 LED=B0 LED_START_FLASHES=2
#make atmega324pa AVR_FREQ=20000000L BAUD_RATE=115200 UART=0 LED=B0 LED_START_FLASHES=2
324.menu.clock.20MHz_external=20 MHz external
324.menu.clock.20MHz_external.upload.speed=115200
324.menu.clock.20MHz_external.bootloader.low_fuses=0xf7
324.menu.clock.20MHz_external.bootloader.high_fuses=0xd6
324.menu.clock.20MHz_external.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.speed}_{build.f_cpu}.hex
324.menu.clock.20MHz_external.build.f_cpu=20000000L

#make atmega324a AVR_FREQ=12000000L BAUD_RATE=57600 UART=0 LED=B0 LED_START_FLASHES=2
#make atmega324p AVR_FREQ=12000000L BAUD_RATE=57600 UART=0 LED=B0 LED_START_FLASHES=2
#make atmega324pa AVR_FREQ=12000000L BAUD_RATE=57600 UART=0 LED=B0 LED_START_FLASHES=2
324.menu.clock.12MHz_external=12 MHz external
324.menu.clock.12MHz_external.upload.speed=57600
324.menu.clock.12MHz_external.bootloader.low_fuses=0xf7
324.menu.clock.12MHz_external.bootloader.high_fuses=0xd6
324.menu.clock.12MHz_external.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.speed}_{build.f_cpu}.hex
324.menu.clock.12MHz_external.build.f_cpu=12000000L

#make atmega324a AVR_FREQ=8000000L BAUD_RATE=115200 UART=0 LED=B0 LED_START_FLASHES=2
#make atmega324p AVR_FREQ=8000000L BAUD_RATE=115200 UART=0 LED=B0 LED_START_FLASHES=2
#make atmega324pa AVR_FREQ=8000000L BAUD_RATE=115200 UART=0 LED=B0 LED_START_FLASHES=2
#make atmega324a AVR_FREQ=8000000L BAUD_RATE=57600 UART=0 LED=B0 LED_START_FLASHES=2
#make atmega324p AVR_FREQ=8000000L BAUD_RATE=57600 UART=0 LED=B0 LED_START_FLASHES=2
#make atmega324pa AVR_FREQ=8000000L BAUD_RATE=57600 UART=0 LED=B0 LED_START_FLASHES=2
324.menu.clock.8MHz_external=8 MHz external
324.menu.clock.8MHz_external.upload.speed=57600
324.menu.clock.8MHz_external.bootloader.low_fuses=0xf7
324.menu.clock.8MHz_external.bootloader.high_fuses=0xd6
324.menu.clock.8MHz_external.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.speed}_{build.f_cpu}.hex
324.menu.clock.8MHz_external.build.f_cpu=8000000L

#make atmega324a AVR_FREQ=8000000L BAUD_RATE=38400 UART=0 LED=B0 LED_START_FLASHES=2
#make atmega324a AVR_FREQ=8000000L BAUD_RATE=19200 UART=0 LED=B0 LED_START_FLASHES=2
#make atmega324p AVR_FREQ=8000000L BAUD_RATE=38400 UART=0 LED=B0 LED_START_FLASHES=2
#make atmega324p AVR_FREQ=8000000L BAUD_RATE=19200 UART=0 LED=B0 LED_START_FLASHES=2
#make atmega324pa AVR_FREQ=8000000L BAUD_RATE=38400 UART=0 LED=B0 LED_START_FLASHES=2
#make atmega324pa AVR_FREQ=8000000L BAUD_RATE=19200 UART=0 LED=B0 LED_START_FLASHES=2
324.menu.clock.8MHz_internal=8 MHz internal
324.menu.clock.8MHz_internal.upload.speed=38400
324.menu.clock.8MHz_internal.bootloader.low_fuses=0xe2
324.menu.clock.8MHz_internal.bootloader.high_fuses=0xd6
324.menu.clock.8MHz_internal.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.speed}_{build.f_cpu}.hex
324.menu.clock.8MHz_internal.build.f_cpu=8000000L

#make atmega324a AVR_FREQ=1000000L BAUD_RATE=9600 UART=0 LED=B0 LED_START_FLASHES=2
#make atmega324p AVR_FREQ=1000000L BAUD_RATE=9600 UART=0 LED=B0 LED_START_FLASHES=2
#make atmega324pa AVR_FREQ=1000000L BAUD_RATE=9600 UART=0 LED=B0 LED_START_FLASHES=2
324.menu.clock.1MHz_internal=1 MHz internal
324.menu.clock.1MHz_internal.upload.speed=9600
324.menu.clock.1MHz_internal.bootloader.low_fuses=0x62
324.menu.clock.1MHz_internal.bootloader.high_fuses=0xd6
324.menu.clock.1MHz_internal.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.speed}_{build.f_cpu}.hex
324.menu.clock.1MHz_internal.build.f_cpu=1000000L


##########################
#### ATmega164A/P/PA  ####
##########################

164.name=ATmega164
164.upload.tool=avrdude
164.upload.protocol=arduino
164.upload.maximum_size=15872
164.upload.maximum_data_size=1024

164.bootloader.tool=arduino:avrdude
164.bootloader.unlock_bits=0x3f
164.bootloader.lock_bits=0x0f

164.build.core=MightyCore
164.build.board=AVR_ATmega164

# Pinouts
164.menu.pinout.standard=Standard
164.menu.pinout.standard.build.variant=standard
164.menu.pinout.bobuino=Bobuino
164.menu.pinout.bobuino.build.variant=bobuino

# Variants
164.menu.variant.modelP=164P / 164PA
164.menu.variant.modelP.build.mcu=atmega164p
164.menu.variant.modelA=164A
164.menu.variant.modelA.build.mcu=atmega164a

# Brown out detection
164.menu.BOD.2v7=2.7v
164.menu.BOD.2v7.bootloader.extended_fuses=0xfd
164.menu.BOD.4v3=4.3v
164.menu.BOD.4v3.bootloader.extended_fuses=0xfc
164.menu.BOD.1v8=1.8v
164.menu.BOD.1v8.bootloader.extended_fuses=0xfe
164.menu.BOD.disabled=Disabled
164.menu.BOD.disabled.bootloader.extended_fuses=0xff

# Compiler link time optimization
164.menu.LTO.Os=Disabled (default)
164.menu.LTO.Os.compiler.c.extra_flags=
164.menu.LTO.Os.compiler.c.elf.extra_flags=
164.menu.LTO.Os.compiler.cpp.extra_flags=
164.menu.LTO.Os.ltoarcmd=avr-ar

164.menu.LTO.Os_flto=Enabled
164.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto
164.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto
164.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto
164.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar

# Clock frequencies
#make atmega164a AVR_FREQ=16000000L BAUD_RATE=115200 UART=0 LED=B0 LED_START_FLASHES=2
#make atmega164p AVR_FREQ=16000000L BAUD_RATE=115200 UART=0 LED=B0 LED_START_FLASHES=2
164.menu.clock.16MHz_external=16 MHz external
164.menu.clock.16MHz_external.upload.speed=115200
164.menu.clock.16MHz_external.bootloader.low_fuses=0xf7
164.menu.clock.16MHz_external.bootloader.high_fuses=0xd4
164.menu.clock.16MHz_external.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.speed}_{build.f_cpu}.hex
164.menu.clock.16MHz_external.build.f_cpu=16000000L

#make atmega164a AVR_FREQ=20000000L BAUD_RATE=115200 UART=0 LED=B0 LED_START_FLASHES=2
#make atmega164p AVR_FREQ=20000000L BAUD_RATE=115200 UART=0 LED=B0 LED_START_FLASHES=2
164.menu.clock.20MHz_external=20 MHz external
164.menu.clock.20MHz_external.upload.speed=115200
164.menu.clock.20MHz_external.bootloader.low_fuses=0xf7
164.menu.clock.20MHz_external.bootloader.high_fuses=0xd4
164.menu.clock.20MHz_external.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.speed}_{build.f_cpu}.hex
164.menu.clock.20MHz_external.build.f_cpu=20000000L

#make atmega164a AVR_FREQ=12000000L BAUD_RATE=57600 UART=0 LED=B0 LED_START_FLASHES=2
#make atmega164p AVR_FREQ=12000000L BAUD_RATE=57600 UART=0 LED=B0 LED_START_FLASHES=2
164.menu.clock.12MHz_external=12 MHz external
164.menu.clock.12MHz_external.upload.speed=57600
164.menu.clock.12MHz_external.bootloader.low_fuses=0xf7
164.menu.clock.12MHz_external.bootloader.high_fuses=0xd4
164.menu.clock.12MHz_external.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.speed}_{build.f_cpu}.hex
164.menu.clock.12MHz_external.build.f_cpu=12000000L

#make atmega164a AVR_FREQ=8000000L BAUD_RATE=115200 UART=0 LED=B0 LED_START_FLASHES=2
#make atmega164p AVR_FREQ=8000000L BAUD_RATE=115200 UART=0 LED=B0 LED_START_FLASHES=2
#make atmega164a AVR_FREQ=8000000L BAUD_RATE=57600 UART=0 LED=B0 LED_START_FLASHES=2
#make atmega164p AVR_FREQ=8000000L BAUD_RATE=57600 UART=0 LED=B0 LED_START_FLASHES=2
164.menu.clock.8MHz_external=8 MHz external
164.menu.clock.8MHz_external.upload.speed=57600
164.menu.clock.8MHz_external.bootloader.low_fuses=0xf7
164.menu.clock.8MHz_external.bootloader.high_fuses=0xd4
164.menu.clock.8MHz_external.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.speed}_{build.f_cpu}.hex
164.menu.clock.8MHz_external.build.f_cpu=8000000L

#make atmega164a AVR_FREQ=8000000L BAUD_RATE=38400 UART=0 LED=B0 LED_START_FLASHES=2
#make atmega164a AVR_FREQ=8000000L BAUD_RATE=19200 UART=0 LED=B0 LED_START_FLASHES=2
#make atmega164p AVR_FREQ=8000000L BAUD_RATE=38400 UART=0 LED=B0 LED_START_FLASHES=2
#make atmega164p AVR_FREQ=8000000L BAUD_RATE=19200 UART=0 LED=B0 LED_START_FLASHES=2
164.menu.clock.8MHz_internal=8 MHz internal
164.menu.clock.8MHz_internal.upload.speed=38400
164.menu.clock.8MHz_internal.bootloader.low_fuses=0xe2
164.menu.clock.8MHz_internal.bootloader.high_fuses=0xd4
164.menu.clock.8MHz_internal.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.speed}_{build.f_cpu}.hex
164.menu.clock.8MHz_internal.build.f_cpu=8000000L

#make atmega164a AVR_FREQ=1000000L BAUD_RATE=9600 UART=0 LED=B0 LED_START_FLASHES=2
#make atmega164p AVR_FREQ=1000000L BAUD_RATE=9600 UART=0 LED=B0 LED_START_FLASHES=2
164.menu.clock.1MHz_internal=1 MHz internal
164.menu.clock.1MHz_internal.upload.speed=9600
164.menu.clock.1MHz_internal.bootloader.low_fuses=0x62
164.menu.clock.1MHz_internal.bootloader.high_fuses=0xd4
164.menu.clock.1MHz_internal.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.speed}_{build.f_cpu}.hex
164.menu.clock.1MHz_internal.build.f_cpu=1000000L


#####################
#### ATmega32/A  ####
#####################

