MCUdude/MightyCore/avr/boards.txt
32.name=ATmega32
32.upload.tool=avrdude
32.upload.protocol=arduino
32.upload.maximum_size=32256
32.upload.maximum_data_size=2048

32.bootloader.tool=avrdude
32.bootloader.unlock_bits=0x3f
32.bootloader.lock_bits=0x0f

32.build.mcu=atmega32
32.build.core=MightyCore
32.build.board=AVR_ATmega32

# Pinouts
32.menu.pinout.standard=Standard
32.menu.pinout.standard.build.variant=standard
32.menu.pinout.bobuino=Bobuino
32.menu.pinout.bobuino.build.variant=bobuino

# Compiler link time optimization
32.menu.LTO.Os=Disabled (default)
32.menu.LTO.Os.compiler.c.extra_flags=
32.menu.LTO.Os.compiler.c.elf.extra_flags=
32.menu.LTO.Os.compiler.cpp.extra_flags=
32.menu.LTO.Os.ltoarcmd=avr-ar

32.menu.LTO.Os_flto=Enabled
32.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto
32.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto
32.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto
32.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar

# Clock frequencies
#make atmega32 AVR_FREQ=16000000L BAUD_RATE=115200 UART=0 LED=B0 LED_START_FLASHES=2
32.menu.clock.16MHz_external=16 MHz external (BOD 2.7v)
32.menu.clock.16MHz_external.upload.speed=115200
32.menu.clock.16MHz_external.bootloader.low_fuses=0xbf
32.menu.clock.16MHz_external.bootloader.high_fuses=0xd6
32.menu.clock.16MHz_external.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.speed}_{build.f_cpu}.hex
32.menu.clock.16MHz_external.build.f_cpu=16000000L

#make atmega32 AVR_FREQ=20000000L BAUD_RATE=115200 UART=0 LED=B0 LED_START_FLASHES=2
32.menu.clock.20MHz_external=20 MHz external (BOD 4.0v)
32.menu.clock.20MHz_external.upload.speed=115200
32.menu.clock.20MHz_external.bootloader.low_fuses=0x3f
32.menu.clock.20MHz_external.bootloader.high_fuses=0xd6
32.menu.clock.20MHz_external.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.speed}_{build.f_cpu}.hex
32.menu.clock.20MHz_external.build.f_cpu=20000000L

#make atmega32 AVR_FREQ=12000000L BAUD_RATE=57600 UART=0 LED=B0 LED_START_FLASHES=2
32.menu.clock.12MHz_external=12 MHz external (BOD 2.7v)
32.menu.clock.12MHz_external.upload.speed=57600
32.menu.clock.12MHz_external.bootloader.low_fuses=0xbf
32.menu.clock.12MHz_external.bootloader.high_fuses=0xd6
32.menu.clock.12MHz_external.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.speed}_{build.f_cpu}.hex
32.menu.clock.12MHz_external.build.f_cpu=12000000L

#make atmega32 AVR_FREQ=8000000L BAUD_RATE=115200 UART=0 LED=B0 LED_START_FLASHES=2
#make atmega32 AVR_FREQ=8000000L BAUD_RATE=57600 UART=0 LED=B0 LED_START_FLASHES=2
32.menu.clock.8MHz_external=8 MHz external  (BOD 2.7v)
32.menu.clock.8MHz_external.upload.speed=57600
32.menu.clock.8MHz_external.bootloader.low_fuses=0xbf
32.menu.clock.8MHz_external.bootloader.high_fuses=0xd6
32.menu.clock.8MHz_external.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.speed}_{build.f_cpu}.hex
32.menu.clock.8MHz_external.build.f_cpu=8000000L

#make atmega32 AVR_FREQ=8000000L BAUD_RATE=38400 UART=0 LED=B0 LED_START_FLASHES=2
#make atmega32 AVR_FREQ=8000000L BAUD_RATE=19200 UART=0 LED=B0 LED_START_FLASHES=2
32.menu.clock.8MHz_internal=8 MHz internal   (BOD 2.7v)
32.menu.clock.8MHz_internal.upload.speed=38400
32.menu.clock.8MHz_internal.bootloader.low_fuses=0xa4
32.menu.clock.8MHz_internal.bootloader.high_fuses=0xd6
32.menu.clock.8MHz_internal.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.speed}_{build.f_cpu}.hex
32.menu.clock.8MHz_internal.build.f_cpu=8000000L

#make atmega32 AVR_FREQ=1000000L BAUD_RATE=9600 UART=0 LED=B0 LED_START_FLASHES=2
32.menu.clock.1MHz_internal=1 MHz internal   (BOD 2.7v)
32.menu.clock.1MHz_internal.upload.speed=9600
32.menu.clock.1MHz_internal.bootloader.low_fuses=0xa1
32.menu.clock.1MHz_internal.bootloader.high_fuses=0xd6
32.menu.clock.1MHz_internal.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.speed}_{build.f_cpu}.hex
32.menu.clock.1MHz_internal.build.f_cpu=1000000L


#####################
#### ATmega16/A  ####
#####################

16.name=ATmega16
16.upload.tool=avrdude
16.upload.protocol=arduino
16.upload.maximum_size=15872
16.upload.maximum_data_size=1024

16.bootloader.tool=avrdude
16.bootloader.unlock_bits=0x3f
16.bootloader.lock_bits=0x0f

16.build.mcu=atmega16
16.build.core=MightyCore
16.build.board=AVR_ATmega16

# Pinouts
16.menu.pinout.standard=Standard
16.menu.pinout.standard.build.variant=standard
16.menu.pinout.bobuino=Bobuino
16.menu.pinout.bobuino.build.variant=bobuino

# Compiler link time optimization
16.menu.LTO.Os=Disabled (default)
16.menu.LTO.Os.compiler.c.extra_flags=
16.menu.LTO.Os.compiler.c.elf.extra_flags=
16.menu.LTO.Os.compiler.cpp.extra_flags=
16.menu.LTO.Os.ltoarcmd=avr-ar

16.menu.LTO.Os_flto=Enabled
16.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto
16.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto
16.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto
16.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar


# Clock frequencies
#make atmega16 AVR_FREQ=16000000L BAUD_RATE=115200 UART=0 LED=B0 LED_START_FLASHES=2
16.menu.clock.16MHz_external=16 MHz external (BOD 2.7v)
16.menu.clock.16MHz_external.upload.speed=115200
16.menu.clock.16MHz_external.bootloader.low_fuses=0xbf
16.menu.clock.16MHz_external.bootloader.high_fuses=0xd4
16.menu.clock.16MHz_external.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.speed}_{build.f_cpu}.hex
16.menu.clock.16MHz_external.build.f_cpu=16000000L

#make atmega16 AVR_FREQ=20000000L BAUD_RATE=115200 UART=0 LED=B0 LED_START_FLASHES=2
16.menu.clock.20MHz_external=20 MHz external (BOD 4.0v)
16.menu.clock.20MHz_external.upload.speed=115200
16.menu.clock.20MHz_external.bootloader.low_fuses=0x3f
16.menu.clock.20MHz_external.bootloader.high_fuses=0xd4
16.menu.clock.20MHz_external.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.speed}_{build.f_cpu}.hex
16.menu.clock.20MHz_external.build.f_cpu=20000000L

#make atmega16 AVR_FREQ=12000000L BAUD_RATE=57600 UART=0 LED=B0 LED_START_FLASHES=2
16.menu.clock.12MHz_external=12 MHz external (BOD 2.7v)
16.menu.clock.12MHz_external.upload.speed=57600
16.menu.clock.12MHz_external.bootloader.low_fuses=0xbf
16.menu.clock.12MHz_external.bootloader.high_fuses=0xd4
16.menu.clock.12MHz_external.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.speed}_{build.f_cpu}.hex
16.menu.clock.12MHz_external.build.f_cpu=12000000L

#make atmega16 AVR_FREQ=8000000L BAUD_RATE=115200 UART=0 LED=B0 LED_START_FLASHES=2
#make atmega16 AVR_FREQ=8000000L BAUD_RATE=57600 UART=0 LED=B0 LED_START_FLASHES=2
16.menu.clock.8MHz_external=8 MHz external   (BOD 2.7v)
16.menu.clock.8MHz_external.upload.speed=115200
16.menu.clock.8MHz_external.bootloader.low_fuses=0xbf
16.menu.clock.8MHz_external.bootloader.high_fuses=0xd4
16.menu.clock.8MHz_external.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.speed}_{build.f_cpu}.hex
16.menu.clock.8MHz_external.build.f_cpu=8000000L

#make atmega16 AVR_FREQ=8000000L BAUD_RATE=38400 UART=0 LED=B0 LED_START_FLASHES=2
#make atmega16 AVR_FREQ=8000000L BAUD_RATE=19200 UART=0 LED=B0 LED_START_FLASHES=2
16.menu.clock.8MHz_internal=8 MHz internal    (BOD 2.7v)
16.menu.clock.8MHz_internal.upload.speed=38400
16.menu.clock.8MHz_internal.bootloader.low_fuses=0xa4
16.menu.clock.8MHz_internal.bootloader.high_fuses=0xd4
16.menu.clock.8MHz_internal.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.speed}_{build.f_cpu}.hex
16.menu.clock.8MHz_internal.build.f_cpu=8000000L

