MCUdude/MightyCore/avr/boards.txt
#make atmega16 AVR_FREQ=1000000L BAUD_RATE=9600 UART=0 LED=B0 LED_START_FLASHES=2
16.menu.clock.1MHz_internal=1 MHz internal    (BOD 2.7v)
16.menu.clock.1MHz_internal.upload.speed=9600
16.menu.clock.1MHz_internal.bootloader.low_fuses=0xa1
16.menu.clock.1MHz_internal.bootloader.high_fuses=0xd4
16.menu.clock.1MHz_internal.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.speed}_{build.f_cpu}.hex
16.menu.clock.1MHz_internal.build.f_cpu=1000000L


#####################
#### ATmega8535  ####
#####################


8535.name=ATmega8535
8535.upload.tool=avrdude
8535.upload.protocol=arduino
8535.upload.maximum_size=7680
8535.upload.maximum_data_size=512

8535.bootloader.tool=avrdude
8535.bootloader.unlock_bits=0x3f
8535.bootloader.lock_bits=0x0f

8535.build.mcu=atmega8535
8535.build.core=MightyCore
8535.build.board=AVR_ATmega8535

# Pinouts
8535.menu.pinout.standard=Standard
8535.menu.pinout.standard.build.variant=standard
8535.menu.pinout.bobuino=Bobuino
8535.menu.pinout.bobuino.build.variant=bobuino

# Compiler link time optimization
8535.menu.LTO.Os=Disabled (default)
8535.menu.LTO.Os.compiler.c.extra_flags=
8535.menu.LTO.Os.compiler.c.elf.extra_flags=
8535.menu.LTO.Os.compiler.cpp.extra_flags=
8535.menu.LTO.Os.ltoarcmd=avr-ar

8535.menu.LTO.Os_flto=Enabled
8535.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto
8535.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto
8535.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto
8535.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar

# Clock frequencies
#make atmega8535 AVR_FREQ=16000000L BAUD_RATE=115200 UART=0 LED=B0 LED_START_FLASHES=2
8535.menu.clock.16MHz_external=16 MHz external (BOD 2.7v)
8535.menu.clock.16MHz_external.upload.speed=115200
8535.menu.clock.16MHz_external.bootloader.low_fuses=0xbf
8535.menu.clock.16MHz_external.bootloader.high_fuses=0xd4
8535.menu.clock.16MHz_external.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.speed}_{build.f_cpu}.hex
8535.menu.clock.16MHz_external.build.f_cpu=16000000L

#make atmega8535 AVR_FREQ=20000000L BAUD_RATE=115200 UART=0 LED=B0 LED_START_FLASHES=2
8535.menu.clock.20MHz_external=20 MHz external (BOD 4.0v)
8535.menu.clock.20MHz_external.upload.speed=115200
8535.menu.clock.20MHz_external.bootloader.low_fuses=0x3f
8535.menu.clock.20MHz_external.bootloader.high_fuses=0xd4
8535.menu.clock.20MHz_external.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.speed}_{build.f_cpu}.hex
8535.menu.clock.20MHz_external.build.f_cpu=20000000L

#make atmega8535 AVR_FREQ=12000000L BAUD_RATE=57600 UART=0 LED=B0 LED_START_FLASHES=2
8535.menu.clock.12MHz_external=12 MHz external (BOD 2.7v)
8535.menu.clock.12MHz_external.upload.speed=57600
8535.menu.clock.12MHz_external.bootloader.low_fuses=0xbf
8535.menu.clock.12MHz_external.bootloader.high_fuses=0xd4
8535.menu.clock.12MHz_external.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.speed}_{build.f_cpu}.hex
8535.menu.clock.12MHz_external.build.f_cpu=12000000L

#make atmega8535 AVR_FREQ=8000000L BAUD_RATE=115200 UART=0 LED=B0 LED_START_FLASHES=2
#make atmega8535 AVR_FREQ=8000000L BAUD_RATE=57600 UART=0 LED=B0 LED_START_FLASHES=2
8535.menu.clock.8MHz_external=8 MHz external   (BOD 2.7v)
8535.menu.clock.8MHz_external.upload.speed=115200
8535.menu.clock.8MHz_external.bootloader.low_fuses=0xbf
8535.menu.clock.8MHz_external.bootloader.high_fuses=0xd4
8535.menu.clock.8MHz_external.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.speed}_{build.f_cpu}.hex
8535.menu.clock.8MHz_external.build.f_cpu=8000000L

#make atmega8535 AVR_FREQ=8000000L BAUD_RATE=38400 UART=0 LED=B0 LED_START_FLASHES=2
#make atmega8535 AVR_FREQ=8000000L BAUD_RATE=19200 UART=0 LED=B0 LED_START_FLASHES=2
8535.menu.clock.8MHz_internal=8 MHz internal   (BOD 2.7v)
8535.menu.clock.8MHz_internal.upload.speed=38400
8535.menu.clock.8MHz_internal.bootloader.low_fuses=0xa4
8535.menu.clock.8MHz_internal.bootloader.high_fuses=0xd4
8535.menu.clock.8MHz_internal.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.speed}_{build.f_cpu}.hex
8535.menu.clock.8MHz_internal.build.f_cpu=8000000L

#make atmega8535 AVR_FREQ=1000000L BAUD_RATE=9600 UART=0 LED=B0 LED_START_FLASHES=2
8535.menu.clock.1MHz_internal=1 MHz internal   (BOD 2.7v)
8535.menu.clock.1MHz_internal.upload.speed=9600
8535.menu.clock.1MHz_internal.bootloader.low_fuses=0xa1
8535.menu.clock.1MHz_internal.bootloader.high_fuses=0xd4
8535.menu.clock.1MHz_internal.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.speed}_{build.f_cpu}.hex
8535.menu.clock.1MHz_internal.build.f_cpu=1000000L
